# INTRO TO PANDAS

##Exercises (Basic)##

1. Create a Pandas Series with your five favorite numbers.

2. Create a DataFrame with columns Name, Age, and Salary for 5 people.

3. Convert a dictionary to a Pandas DataFrame and print its shape.

4. Import a CSV file into a DataFrame and display the first five rows.

5. Create a DataFrame from a list of dictionaries.

In [4]:
#Q1
import pandas as pd
df = pd.Series([1,2,3,4,5])
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
#Q2
dict = {
    'Name' : ["Ahmed","Saad","Ayan","Fuzail","Mughees"],
    'Salary' : [10000,3000,30000,0,0],
    'Age' : [20,19,19,20,19]
}

df2 = pd.DataFrame(dict)
print(df2)
#Q3
print(df2.shape)

      Name  Salary  Age
0    Ahmed   10000   20
1     Saad    3000   19
2     Ayan   30000   19
3   Fuzail       0   20
4  Mughees       0   19
(5, 3)

In [13]:
#Q4
df3 = pd.read_excel('SaleData.xlsx')
df3.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.0,1198.0,113810.0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.0,500.0,25000.0
2,2018-02-09,Central,Hermann,Luis,Television,36.0,1198.0,43128.0
3,2018-02-26,Central,Timothy,David,Cell Phone,27.0,225.0,6075.0
4,2018-03-15,West,Timothy,Stephen,Television,56.0,1198.0,67088.0

In [17]:
import pandas as pd

# Proper list of dictionaries (each dictionary representing one row)
data = [
    {'Name': 'Ahmed', 'Salary': 10000, 'Age': 20},
    {'Name': 'Saad', 'Salary': 3000, 'Age': 19},
    {'Name': 'Ayan', 'Salary': 30000, 'Age': 19},
    {'Name': 'Fuzail', 'Salary': 0, 'Age': 20},
    {'Name': 'Mughees', 'Salary': 0, 'Age': 19}
]

# Creating DataFrame
df3 = pd.DataFrame(data)

# Display DataFrame
print(df3)

      Name  Salary  Age
0    Ahmed   10000   20
1     Saad    3000   19
2     Ayan   30000   19
3   Fuzail       0   20
4  Mughees       0   19